MAIL_REJECT_TEMPLATE_HTML = '''
<div font-family:Calibri,Arial,Helvetica,sans-serif;color:rgb(0,0,0) dir="rtl" style="font-size: 15px">
{name} عزیز
<br/>
با سلام و آرزوی سلامتی؛
<br/>
ضمن تشکر از درخواست و استقبال شما برای دستیاری آموزشی درس مبانی برنامه‌سازی، پس از بررسی و نمره دهی به فایل‌های ارسالی برای چالش تمامی افرادی که در چالش شرکت کرده بودند توسط 10 نفر از افرادی که در ترم‌های گذشته سابقه دستیاری دروس مبانی برنامه سازی و برنامه سازی پیشرفته را داشتند، با توجه به محدود بودن حجم کارها و عدم امکان جذب همه درخواست‌دهندگان، با وجود شایستگی متأسفانه سعادت همکاری با شما را نداشتیم. امیدواریم که بتوانیم در ترم‌های آینده از کمک شما برای دروس مختلف استفاده کنیم.
<br/>
<br/>
با تشکر و احترام فراوان؛
<br/>
تیم دستیاران آموزشی درس مبانی برنامه سازی
</div>
'''

MAIL_REJECT_TEMPLATE_PLAIN = '''

{name} عزیز

با سلام و آرزوی سلامتی؛

ضمن تشکر از درخواست و استقبال شما برای دستیاری آموزشی درس مبانی برنامه‌سازی، پس از بررسی و نمره دهی به فایل‌های ارسالی برای چالش تمامی افرادی که در چالش شرکت کرده بودند توسط 10 نفر از افرادی که در ترم‌های گذشته سابقه دستیاری دروس مبانی برنامه سازی و برنامه سازی پیشرفته را داشتند، با توجه به محدود بودن حجم کارها و عدم امکان جذب همه درخواست‌دهندگان، با وجود شایستگی متأسفانه سعادت همکاری با شما را نداشتیم. امیدواریم که بتوانیم در ترم‌های آینده از کمک شما برای دروس مختلف استفاده کنیم.

با تشکر و احترام فراوان؛
تیم دستیاران آموزشی درس مبانی برنامه سازی


'''

MAIL_CHALLENGE_TEMPLATE_HTML = '''
<div font-family:Calibri,Arial,Helvetica,sans-serif;color:rgb(0,0,0) dir="rtl" style="font-size: 15px">
{name} عزیز
<br/>
سلام و خسته نباشید.
<br/>
از این که فرم دستیاری آموزشی درس مبانی برنامه‌سازی را پر کردید از شما خیلی ممنونیم.
<br/>
نزدیک به ۱۱۵ نفر فرم امسال را پر کرده‌اند که باعث افتخار و خشنودی ماست که این تعداد از دانشجویان علاقه‌مند و باانگیزه برای دستیاری این درس اعلام آمادگی کردند. 
<br/>
از آن جایی که امکان جذب همه شما عزیزان وجود ندارد، لازم بود که مرحله دیگری را در فرآیند جذب دستیاران آموزشی وارد کنیم تا بتوانیم تواناترین و باانگیزه‌ترین افراد را انتخاب کنیم تا بتوانیم به بهترین شکل درس را ارائه بدهیم. از این رو تصمیم گرفتیم از متقاضیان دستیاری آموزشی این درس بخواهیم تا با انجام چالش زیر به ما در انتخاب بهترین افراد کمک کنند.
<br/>
درس، سه بخش اصلی تمرین (طرح سوالات، پاسخ نمونه و تست‌ها)، پروژه (طرح نیازمندی‌ها و محتوای پروژه) و آموزش (محتوای آموزشی، کدنامه و موارد مورد نیاز اضافی برای تمرین‌ها یا پروژه، کلاس پیشرفته) داشته و هر فرد باید حداقل در یکی از این سه بخش فعالیت کند. متقاضیان فعالیت در تمرین و پروژه، باید چالش بخش تمرین و متقاضیان بخش آموزش، چالش مربوط به آن را انجام بدهند. افرادی که برای بخش معرفی تی‌ای اعلام آمادگی کرده‌اند هم چالش مربوط به آن را انجام بدهند. هر فرد باید حداقل یکی از این چالش‌ها را انجام دهد، ولی می‌تواند چالش‌ چند بخش را نیز انجام دهد. طبیعتاً انجام چالش چند بخش با کیفیت بالا، احتمال انتخاب شما را بسیار بالاتر می‌برد. با این وجود، اولویت اصلی ما برای انتخاب، در وهله اول کیفیت کار ارائه شده توسط شما است؛ پس کیفیت را فدای کمیت نکنید. در نتیجه، انجام چالش یک بخش با کیفیت بالا، بسیار باارزش‌تر از انجام هر سه چالش با کیفیت متوسط است.
<br/>
<br/>
<br/>


<h3>
چالش بخش تمرین:
</h3>

<br/>
برای بخش تمرین درس، شما باید بر اساس موضوع و درجه سختی نوشته شده در زیر دو سؤال طرح کنید (یک سؤال برای هر بخش). اولویت‌های ما در ارزیابی کار شما، بار آموزشی سؤال طراحی شده، کیفیت نگارش و واضح بودن سؤال طراحی شده است. الزامی به طراحی تست کیس برای سؤال نیست اما در صورتی که فکر می‌کنید می‌توان برای سؤال گفته شده تست کیس‌های نکته دار و زیبایی طراحی کرد، می‌توانید آن‌ها را هم ضمیمه کنید یا در متن سؤال به آن اشاره کنید. همچنین برای هر سؤال باید کدی به زبان C هم ارسال کنید و سؤال مطرح شده را حل کنید. طبیعتاً سؤال‌های نو و غیرتکراری از ارزش بالاتری برخوردار هستند. در نتیجه از سؤالاتی که در بانک سؤالات سایت کوئرا قرار دارند و یا تمرین‌های درس در سالی که خودتان درس را داشتید، استفاده نکنید.
<br/>
<b>
موضوع سؤال اول: سوال از مبحث {subject1} – با درجه سختی: {diff1}
</b>


<br/>
<b>
موضوع سؤال دوم: سوال از مبحث {subject2} – با درجه سختی: {diff2}
</b>

<br/>
<br/>
<br/>
<h3>
چالش بخش آموزش:
</h3>
<br/>
برای بخش آموزش، شما باید متنی در حد یک یا دو صفحه در مورد موضوعی مرتبط با دنیای برنامه‌نویسی که در سیلابس اصلی درس به طور مستقیم مطرح نمی‌شود، بنویسید. سیلابس اصلی درس را می‌توانید از سایت مستندات دانشکده مشاهده کنید. در انتخاب موضوع آزاد هستید، اما باید توجه کنید که سطح کلی موضوع، متناسب دانش‌جویی که به تازگی با اصول کلی برنامه‌نویسی آشنا شده است، بوده و هم‌چنین نوین و غیرتکراری باشد. موضوع مورد بحث می‌تواند مستقیماً مرتبط با زبان C باشد و یا این که به طور کلی‌تر مربوط به دنیای علوم و مهندسی کامپیوتر و برنامه‌نویسی - ولی مرتبط به مباحث مبانی برنامه‌سازی - باشد.
<br/>
<br/>
<br/>
<h3>
چالش بخش معرفی تی‌ای:
</h3>
<br/>
برای این بخش، با توجه به پیام‌های معرفی تی‌ای که در کانال‌های ترم‌های قبل موجود است، متنی با محتواهای مشابه برای معرفی  خودتان یا یکی از هم‌دوره‌ای هایتان بنویسید.
<br/>
در مورد این بخش توجه کنید که در نهایت 
<b>تنها یک نفر</b>
 برای این بخش انتخاب خواهد شد. در نتیجه اگر علاقه دارید به جز این قسمت در بخش‌های دیگری از درس هم فعالیت کنید، حتما چالش مربوط به آن قسمت را هم انجام بدهید.
<br>
<br>

در انتها پنج نکته لازم به ذکر است:

1.فایل‌های مربوط به هر چالش را به طور جداگانه به قالب یک فایل فشرده با فرمت zip تبدیل کرده و آپلود کنید.
<br/>
لینک فرم آپلود فایل‌های مربوط به هر چالش در کانال تلگرامی با آی‌دی زیر قرار دارد. امکان ارسال لینک به صورت مستقیم در ایمیل به دلیل تشخیص آن به عنوان اسپم وجود نداشت. در صورتی که امکان دسترسی به کانال را ندارید به امیرمهدی نامجو پیام بدهید.
<br/>
@fop_ce_2022
<br/>
2.	انجام چالش تمرین به‌وسیله  LaTeXیا Markdown  اجباری نیست؛ اما نکته مثبت مهمی محسوب می‌شود و بر استفاده از ورد یا ابزارهای مشابه اولویت داشته احتمال انتخاب شما را بالاتر می‌برد.
<br/>
3.	رعایت اصول نگارشی بر اساس آیین‌نامه‌ی دانشکده در متن ارائه شده توسط شما اهمیت بالایی دارد.
<br/>
4.	عدم شرکت در چالش به منزله انصراف شما از دستیاری آموزشی درس تلقی می‌شود.
<br/>
5.	مهلت ارسال چالش تا انتهای روز چهارشنه ۲ شهریور است.


<br/>
در پایان بار دیگر از ابراز علاقه شما برای دستیاری آموزشی این درس تشکر می‌کنیم. ان‌شاءالله بتوانیم در کنار هم درس خوبی را ارائه بدهیم.
<br/>
هر سؤالی هم داشتید، می‌توانید از هد تی‌ای درس (امیرمهدی نامجو) از طریق آی‌دی @amir_astrophysics و یا ایمیل amirmahdi.namjoo1@gmail.com بپرسید. لطفا برای آدرس ایمیلی که این پیام را از آن دریافت کرده‌اید، سوالی ارسال نکنید.
<br/>
<br/>

با تشکر و احترام؛ تیم درس مبانی برنامه‌سازی
</div>
'''

MAIL_CHALLENGE_TEMPLATE_PLAIN = '''

{name} عزیز

سلام و خسته نباشید.

از این که فرم دستیاری آموزشی درس مبانی برنامه‌سازی را پر کردید از شما خیلی ممنونیم.

نزدیک به ۱۱۵ نفر فرم امسال را پر کرده‌اند که باعث افتخار و خشنودی ماست که این تعداد از دانشجویان علاقه‌مند و باانگیزه برای دستیاری این درس اعلام آمادگی کردند. 

از آن جایی که امکان جذب همه شما عزیزان وجود ندارد، لازم بود که مرحله دیگری را در فرآیند جذب دستیاران آموزشی وارد کنیم تا بتوانیم تواناترین و باانگیزه‌ترین افراد را انتخاب کنیم تا بتوانیم به بهترین شکل درس را ارائه بدهیم. از این رو تصمیم گرفتیم از متقاضیان دستیاری آموزشی این درس بخواهیم تا با انجام چالش زیر به ما در انتخاب بهترین افراد کمک کنند.

درس، سه بخش اصلی تمرین (طرح سوالات، پاسخ نمونه و تست‌ها)، پروژه (طرح نیازمندی‌ها و محتوای پروژه) و آموزش (محتوای آموزشی، کدنامه و موارد مورد نیاز اضافی برای تمرین‌ها یا پروژه، کلاس پیشرفته) داشته و هر فرد باید حداقل در یکی از این سه بخش فعالیت کند. متقاضیان فعالیت در تمرین و پروژه، باید چالش بخش تمرین و متقاضیان بخش آموزش، چالش مربوط به آن را انجام بدهند. افرادی که برای بخش معرفی تی‌ای اعلام آمادگی کرده‌اند هم چالش مربوط به آن را انجام بدهند. هر فرد باید حداقل یکی از این چالش‌ها را انجام دهد، ولی می‌تواند چالش‌ چند بخش را نیز انجام دهد. طبیعتاً انجام چالش چند بخش با کیفیت بالا، احتمال انتخاب شما را بسیار بالاتر می‌برد. با این وجود، اولویت اصلی ما برای انتخاب، در وهله اول کیفیت کار ارائه شده توسط شما است؛ پس کیفیت را فدای کمیت نکنید. در نتیجه، انجام چالش یک بخش با کیفیت بالا، بسیار باارزش‌تر از انجام هر سه چالش با کیفیت متوسط است.




چالش بخش تمرین:



برای بخش تمرین درس، شما باید بر اساس موضوع و درجه سختی نوشته شده در زیر دو سؤال طرح کنید (یک سؤال برای هر بخش). اولویت‌های ما در ارزیابی کار شما، بار آموزشی سؤال طراحی شده، کیفیت نگارش و واضح بودن سؤال طراحی شده است. الزامی به طراحی تست کیس برای سؤال نیست اما در صورتی که فکر می‌کنید می‌توان برای سؤال گفته شده تست کیس‌های نکته دار و زیبایی طراحی کرد، می‌توانید آن‌ها را هم ضمیمه کنید یا در متن سؤال به آن اشاره کنید. همچنین برای هر سؤال باید کدی به زبان C هم ارسال کنید و سؤال مطرح شده را حل کنید. طبیعتاً سؤال‌های نو و غیرتکراری از ارزش بالاتری برخوردار هستند. در نتیجه از سؤالاتی که در بانک سؤالات سایت کوئرا قرار دارند و یا تمرین‌های درس در سالی که خودتان درس را داشتید، استفاده نکنید.

موضوع سؤال اول: سوال از مبحث {subject1} – با درجه سختی: {diff1}




موضوع سؤال دوم: سوال از مبحث {subject2} – با درجه سختی: {diff2}



چالش بخش آموزش:

برای بخش آموزش، شما باید متنی در حد یک یا دو صفحه در مورد موضوعی مرتبط با دنیای برنامه‌نویسی که در سیلابس اصلی درس به طور مستقیم مطرح نمی‌شود، بنویسید. سیلابس اصلی درس را می‌توانید از سایت مستندات دانشکده مشاهده کنید. در انتخاب موضوع آزاد هستید، اما باید توجه کنید که سطح کلی موضوع، متناسب دانش‌جویی که به تازگی با اصول کلی برنامه‌نویسی آشنا شده است، بوده و هم‌چنین نوین و غیرتکراری باشد. موضوع مورد بحث می‌تواند مستقیماً مرتبط با زبان C باشد و یا این که به طور کلی‌تر مربوط به دنیای علوم و مهندسی کامپیوتر و برنامه‌نویسی - ولی مرتبط به مباحث مبانی برنامه‌سازی - باشد.

چالش بخش معرفی تی‌ای:

برای این بخش، با توجه به پیام‌های معرفی تی‌ای که در کانال‌های ترم‌های قبل موجود است، متنی با محتواهای مشابه برای معرفی  خودتان یا یکی از هم‌دوره‌ای هایتان بنویسید.

در مورد این بخش توجه کنید که در نهایت 
تنها یک نفر
 برای این بخش انتخاب خواهد شد. در نتیجه اگر علاقه دارید به جز این قسمت در بخش‌های دیگری از درس هم فعالیت کنید، حتما چالش مربوط به آن قسمت را هم انجام بدهید.


در انتها پنج نکته لازم به ذکر است:

1.	فایل‌های مربوط به هر چالش را به طور جداگانه به قالب یک فایل فشرده با فرمت zip تبدیل کرده و آپلود کنید.
لینک فرم آپلود فایل‌های مربوط به هر چالش در کانال تلگرامی با آی‌دی زیر قرار دارد. امکان ارسال لینک به صورت مستقیم در ایمیل به دلیل تشخیص آن به عنوان اسپم وجود نداشت. در صورتی که امکان دسترسی به کانال را ندارید به امیرمهدی نامجو پیام بدهید.
@fop_ce_2022
2.	انجام چالش تمرین به‌وسیله  LaTeXیا Markdown  اجباری نیست؛ اما نکته مثبت مهمی محسوب می‌شود و بر استفاده از ورد یا ابزارهای مشابه اولویت داشته احتمال انتخاب شما را بالاتر می‌برد.
3.	رعایت اصول نگارشی بر اساس آیین‌نامه‌ی دانشکده در متن ارائه شده توسط شما اهمیت بالایی دارد.
4.	عدم شرکت در چالش به منزله انصراف شما از دستیاری آموزشی درس تلقی می‌شود.
5.	مهلت ارسال چالش تا انتهای روز چهارشنه ۲ شهریور است.

در پایان بار دیگر از ابراز علاقه شما برای دستیاری آموزشی این درس تشکر می‌کنیم. ان‌شاءالله بتوانیم در کنار هم درس خوبی را ارائه بدهیم.

هر سؤالی هم داشتید، می‌توانید از هد تی‌ای درس (امیرمهدی نامجو) از طریق آی‌دی @amir_astrophysics و یا ایمیل amirmahdi.namjoo1@gmail.com بپرسید. لطفا برای آدرس ایمیلی که این پیام را از آن دریافت کرده‌اید، سوالی ارسال نکنید.


با تشکر و احترام؛ تیم درس مبانی برنامه‌سازی

'''
